---
kind: type
id: T:Autodesk.Revit.DB.FilterStringLessOrEqual
source: html/e5460dcc-f36c-1701-9489-3ca2d91946e9.htm
---
# Autodesk.Revit.DB.FilterStringLessOrEqual

Tests whether string values from the document would sort before or match a certain string.

## Syntax (C#)
```csharp
public class FilterStringLessOrEqual : FilterStringRuleEvaluator
```

## Remarks
All string comparisons in this class are performed in the case-insensitive manner.